HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEmem_mpu_reg.h
/** \brief 70, EMEM Module Region i Lower Address Register */
#define EMEMMPU0_RGNWRN2_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB000070u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN2_RGNLA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN2_RGNLA.
*/
#define EMEMMPU0_RGNLA2 (EMEMMPU0_RGNWRN2_RGNLA)

/** \brief 74, EMEM Module Region i Upper Address Register */
#define EMEMMPU0_RGNWRN2_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB000074u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN2_RGNUA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN2_RGNUA.
*/
#define EMEMMPU0_RGNUA2 (EMEMMPU0_RGNWRN2_RGNUA)

/** \brief 78, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU0_RGNWRN2_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB000078u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN2_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN2_RGNACCENWA.
*/
#define EMEMMPU0_RGNACCENWA2 (EMEMMPU0_RGNWRN2_RGNACCENWA)

/** \brief 7C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU0_RGNWRN2_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB00007Cu)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN2_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN2_RGNACCENWB.
*/
#define EMEMMPU0_RGNACCENWB2 (EMEMMPU0_RGNWRN2_RGNACCENWB)

/** \brief 80, EMEM Module Region i Lower Address Register */
#define EMEMMPU0_RGNWRN3_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB000080u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN3_RGNLA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN3_RGNLA.
*/
#define EMEMMPU0_RGNLA3 (EMEMMPU0_RGNWRN3_RGNLA)

/** \brief 84, EMEM Module Region i Upper Address Register */
#define EMEMMPU0_RGNWRN3_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB000084u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN3_RGNUA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN3_RGNUA.
*/
#define EMEMMPU0_RGNUA3 (EMEMMPU0_RGNWRN3_RGNUA)

/** \brief 88, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU0_RGNWRN3_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB000088u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN3_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN3_RGNACCENWA.
*/
#define EMEMMPU0_RGNACCENWA3 (EMEMMPU0_RGNWRN3_RGNACCENWA)

/** \brief 8C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU0_RGNWRN3_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB00008Cu)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN3_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN3_RGNACCENWB.
*/
#define EMEMMPU0_RGNACCENWB3 (EMEMMPU0_RGNWRN3_RGNACCENWB)

/** \brief 90, EMEM Module Region i Lower Address Register */
#define EMEMMPU0_RGNWRN4_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB000090u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN4_RGNLA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN4_RGNLA.
*/
#define EMEMMPU0_RGNLA4 (EMEMMPU0_RGNWRN4_RGNLA)

/** \brief 94, EMEM Module Region i Upper Address Register */
#define EMEMMPU0_RGNWRN4_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB000094u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN4_RGNUA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN4_RGNUA.
*/
#define EMEMMPU0_RGNUA4 (EMEMMPU0_RGNWRN4_RGNUA)

/** \brief 98, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU0_RGNWRN4_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB000098u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN4_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN4_RGNACCENWA.
*/
#define EMEMMPU0_RGNACCENWA4 (EMEMMPU0_RGNWRN4_RGNACCENWA)

/** \brief 9C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU0_RGNWRN4_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB00009Cu)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN4_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN4_RGNACCENWB.
*/
#define EMEMMPU0_RGNACCENWB4 (EMEMMPU0_RGNWRN4_RGNACCENWB)

/** \brief A0, EMEM Module Region i Lower Address Register */
#define EMEMMPU0_RGNWRN5_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB0000A0u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN5_RGNLA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN5_RGNLA.
*/
#define EMEMMPU0_RGNLA5 (EMEMMPU0_RGNWRN5_RGNLA)

/** \brief A4, EMEM Module Region i Upper Address Register */
#define EMEMMPU0_RGNWRN5_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB0000A4u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN5_RGNUA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN5_RGNUA.
*/
#define EMEMMPU0_RGNUA5 (EMEMMPU0_RGNWRN5_RGNUA)

/** \brief A8, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU0_RGNWRN5_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB0000A8u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN5_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN5_RGNACCENWA.
*/
#define EMEMMPU0_RGNACCENWA5 (EMEMMPU0_RGNWRN5_RGNACCENWA)

/** \brief AC, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU0_RGNWRN5_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB0000ACu)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN5_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN5_RGNACCENWB.
*/
#define EMEMMPU0_RGNACCENWB5 (EMEMMPU0_RGNWRN5_RGNACCENWB)

/** \brief B0, EMEM Module Region i Lower Address Register */
#define EMEMMPU0_RGNWRN6_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB0000B0u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN6_RGNLA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN6_RGNLA.
*/
#define EMEMMPU0_RGNLA6 (EMEMMPU0_RGNWRN6_RGNLA)

/** \brief B4, EMEM Module Region i Upper Address Register */
#define EMEMMPU0_RGNWRN6_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB0000B4u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN6_RGNUA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN6_RGNUA.
*/
#define EMEMMPU0_RGNUA6 (EMEMMPU0_RGNWRN6_RGNUA)

/** \brief B8, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU0_RGNWRN6_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB0000B8u)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN6_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN6_RGNACCENWA.
*/
#define EMEMMPU0_RGNACCENWA6 (EMEMMPU0_RGNWRN6_RGNACCENWA)

/** \brief BC, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU0_RGNWRN6_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB0000BCu)
/** Alias (User Manual Name) for EMEMMPU0_RGNWRN6_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU0_RGNWRN6_RGNACCENWB.
*/
#define EMEMMPU0_RGNACCENWB6 (EMEMMPU0_RGNWRN6_RGNACCENWB)

